app/models/user.rb

        def self.search(param)
---
SELECT "users".* FROM "users" WHERE (first_name like '%uuuu%')